#Пользователь вводит число, Программа возвращает простые делители введенного числа,
# или сообщает, что оно простое.
def prime_factors(n):
    # Создаем пустой список для хранения простых делителей
    factors = []
    # Ищем делитель от 2 до корня из числа
    while n > 1:
        for i in range(2, int(n**0.5) + 1):
            if n % i == 0:
                factors.append(i)
                n //= i
                break
        else:
            # Если нет делителей от 2 до корня из числа, оно простое
            factors.append(n)
            break
    return factors

# Получаем число от пользователя
n= int(input("Введите число: "))

# Вызываем функцию для поиска простых делителей
factors = prime_factors(n)

# Если список делителей пустой, то число простое
if len(factors) == 0:
    print(n, "является простым числом")
else:
    print("Простые делители числа", n, ":", factors)

